[{
    "title": "Label Calibration in Source Free Domain Adaptation",
    "image": "/images/publications/eks.png",
    "authors": "Shivangi Rai, Rini Smita Thakur, Kunal Jangid, Vinod K Kurmi",
    "conference": "IEEE/CVF Winter Conference on Applications of Computer Vision (WACV) 2025",
    "links":{
      "Label Calibration in Source Free Domain Adaptation":"https://openaccess.thecvf.com/content/WACV2025/papers/Rai_Label_Calibration_in_Source_Free_Domain_Adaptation_WACV_2025_paper.pdf"
    },
    "details":{
      "abstract":"Source-free domain adaptation (SFDA) utilizes a pre-trained source model with unlabeled target data. Self-supervised SFDA techniques generate pseudolabels from the pre-trained source model, but these pseudolabels often contain noise due to domain discrepancies between the source and target domains. Traditional self-supervised SFDA techniques rely on deterministic model predictions using the softmax function, leading to unreliable pseudolabels. In this work, we propose to introduce predictive uncertainty and softmax calibration for pseudolabel refinement using evidential deep learning. The Dirichlet prior is placed over the output of the target network to capture uncertainty using evidence with a single forward pass. Furthermore, softmax calibration solves the translation invariance problem to assist in learning with noisy labels. We incorporate a combination of evidential deep learning loss and information maximization loss with calibrated softmax in both prior and non-prior target knowledge SFDA settings. Extensive experimental analysis shows that our method outperforms other state-of-the-art methods on benchmark datasets. ",
      "bibtex":"@InProceedings{eks_es_WACV2025,\nauthor    = {Rai, Shivangi, \nand Thakur, Rini Smita, \nJangid, Kunal \nand Kurmi, Vinod},\ntitle     = {Evidential Deep Learning for \nPseudolabel Refinement in Source Free \nDomain Adaptation},\nbooktitle = {Proceedings of the IEEE/CVF Winter \nConference on Applications of Computer Vision \n(WACV)},\nyear      = {2025},\n}"
    }     
  },
  {
    "title": "Point of Interest Recommendation System Using Sentiment Analysis",
    "image": "/images/publications/intersp.jpg",
    "authors": "Gaurav Meena, Ajay Indian, Krishna Kumar Mohbey, Kunal Jangid",
    "conference": "JISTaP 2024",
    "links":{
      "Point of Interest Recommendation System Using Sentiment Analysis":"https://accesson.kr/jistap/v.12/2/64/42868"
    },
    "details":{
      "abstract":"",
      "bibtex":"@article{meena2024point, \n   title={Point of interest recommendation system using sentiment analysis}, \n author={Meena, Gaurav and Indian, Ajay and Mohbey, Krishna Kumar and Jangid, Kunal}, journal={Journal of Information Science Theory and Practice}, volume={12},   number={2}, pages={64--78},  year={2024},  publisher={Korea Institute of Science and Technology Information} } "
      }    
  }
]